---
kind: type
id: T:Autodesk.Revit.DB.WorksharingDisplayGraphicSettings
source: html/994d2fb5-11cc-6756-155b-d496eedbe800.htm
---
# Autodesk.Revit.DB.WorksharingDisplayGraphicSettings

Represents the graphical settings that can be assigned to elements in the worksharing
 display modes.

## Syntax (C#)
```csharp
public class WorksharingDisplayGraphicSettings : IDisposable
```